      ******************************************************************
      * Author: Vincent SenClair
      * Date: 4-13-18
      * Purpose: Hello world program
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       DATA DIVISION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "HELLO WORLD".
       END PROGRAM HELLO-WORLD.
