      ******************************************************************
      * Author: VINCENT SENCLAIR
      * Date: 4-18-18
      * Purpose: DEMONSTRATE MERGE SORT AND RECURSION, TWO COMMON
      *  AND POWERFUL TOOLS, IN COBOL
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. MERGESORT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
      *    THE MASTER LIST, CONTAINS UNSORTED DATA TO BE SORTED
       01 MASTER.
           05 MDATA PIC 99 OCCURS 30 TIMES INDEXED BY INDX-1.

      *    ARRAYS TO BE PASSED TO DIVIDER
       01 LEFTSIDE.
           05 LDATA PIC 99 OCCURS 30 TIMES INDEXED BY INDX-2.
       01 RIGHTSIDE.
           05 RDATA PIC 99 OCCURS 30 TIMES INDEXED BY INDX-3.

      *    VARIABLES FOR USE OF RANDOM FUNCTIONALITY TO FILL MASTER LIST
       01 RANDO PIC 99.
       01 SEED PIC 99.

      *    VARIABLES TO CONTROL SIZE OF ARRAYS
       01 LSIZE PIC 99.
       01 RSIZE PIC 99.
       01 FULLSIZE PIC 99.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
      *    COMPUTE SIZES OF ARRAYS
            COMPUTE FULLSIZE = LENGTH OF MASTER / LENGTH OF MDATA
            COMPUTE LSIZE = FULLSIZE / 2
            COMPUTE RSIZE = FULLSIZE - LSIZE

      *    RANDOMIZE INPUT ARRAY
            ACCEPT SEED FROM TIME
            COMPUTE RANDO = FUNCTION RANDOM(SEED)
            PERFORM VARYING INDX-1 FROM 1 BY 1 UNTIL INDX-1 > FULLSIZE
               COMPUTE RANDO = (FUNCTION RANDOM() * 99) + 1
               SET MDATA(INDX-1) TO RANDO
            END-PERFORM.

            PERFORM VARYING INDX-1 FROM 1 BY 1 UNTIL INDX-1 > FULLSIZE
               DISPLAY MDATA(INDX-1)
            END-PERFORM.

            CALL "DIVIDER" USING MASTER, LEFTSIDE,
            RIGHTSIDE, FULLSIZE, LSIZE, RSIZE

            DISPLAY "SORTED ARRAY: "
            PERFORM VARYING INDX-1 FROM 1 BY 1 UNTIL INDX-1 > FULLSIZE
               DISPLAY MDATA(INDX-1)
            END-PERFORM.

       END PROGRAM MERGESORT.
